soap-samples/triangle-request.xml


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:shape="http://webservice.wdu/shapetool">
   <soapenv:Header/>
   <soapenv:Body>
      <shape:TriangleAreaRequest>
         <shape:base>10.0</shape:base>
         <shape:height>5.0</shape:height>
      </shape:TriangleAreaRequest>
   </soapenv:Body>
</soapenv:Envelope>